let city_res = 14;
let type_res = 15;

function chanCity(city) {
    if (city == 1) {
        console.log("시발");
        num = new Array("","강남구", "강동구", "강북구", "강서구", "관악구", "광진구", "구로구", "금천구", "노원구", "도봉구", "동대문구", "동작구", "마포구",
            "서대문구", "서초구", "성동구", "성북구", "송파구", "양천구", "영등포구", "용산구", "은평구", "종로구", "중구", "중랑구");
        vnum = new Array("","1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25");
    }
    if (city == 2) {
        num = new Array("","강화군", "계양구", "미추홀구", "남동구", "동구", "부평구", "서구", "연수구", "옹진군", "중구");
        vnum = new Array("","1", "2", "3", "4", "5", "6", "7", "8", "9", "10");
    }
    if (city == 3) {
        num = new Array("","대덕구", "동구", "서구", "유성구", "중구");
        vnum = new Array("","1", "2", "3", "4", "5");
    }
    if (city == 4) {
        num = new Array("","남구", "달서구", "달성군", "동구", "북구", "서구", "수성구", "중구");
        vnum = new Array("","1", "2", "3", "4", "5", "6", "7", "8");
    }

    if (city == 5) {
        num = new Array("","광산구", "남구", "동구", "북구", "서구");
        vnum = new Array("","1", "2", "3", "4", "5");
    }
    if (city == 6) {
        num = new Array("","강서구", "금정구", "기장군", "남구", "동구", "동래구", "부산진구", "북구", "사상구", "사하구", "서구", "수영구", "연제구", "영도구", "중구", "해운대구");
        vnum = new Array("","1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16");
    }
    if (city == 7) {
        num = new Array("","중구", "남구", "동구", "북구", "울주군");
        vnum = new Array("","1", "2", "3", "4", "5");
    }
    if (city == 31) {
        num = new Array("","가평군", "고양시", "과천시", "광명시", "광주시", "구리시", "군포시", "김포시", "남양주시", "동두천시", "부천시", "성남시", "수원시", "시흥시", "안산시", "안성시", "안양시", "양주시", "양평군", "여주시", "연천군", "오산시", "용인시", "의왕시", "의정부시", "이천시", "파주시", "평택시", "포천시", "하남시", "화성시");
        vnum = new Array("","1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31");
    }
    if (city == 33) {
        num = new Array("","괴산군", "단양군", "보은군", "영동군", "옥천군", "음성군", "제천시", "진천군", "청원군", "청주시", "충주시", "증평군");
        vnum = new Array("","1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12");
    }
    if (city == 34) {
        num = new Array("","공주시", "금산군", "논산시", "당진시", "보령시", "부여군", "서산시", "서천군", "아산시", "예산군", "천안시", "청양군", "태안군", "홍성군", "계룡시");
        vnum = new Array("","1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16");
    }
    if (city == 35) {
        num = new Array("","경산시", "경주시", "고령군", "구미시", "군위군", "김천시", "문경시", "봉화군", "상주시", "성주군", "안동시", "영덕군", "영양군", "영주시", "영천시", "예천군", "울릉군", "울진군", "의성군", "청도군", "청송군", "칠곡군", "포항시");
        vnum = new Array("","1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23");
    }
    if (city == 36) {
        num = new Array("","거제시", "거창군", "고성군", "김해시", "남해군", "마산시", "밀양시", "사천시", "산청군", "양산시", "의령군", "진주시", "진해시", "창녕군", "창원시", "통영시", "하동군", "함안군", "함양군", "합천군");
        vnum = new Array("","1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21");
    }
    if (city == 37) {
        num = new Array("","고창군", "군산시", "김제시", "남원시", "무주군", "부안군", "순창군", "완주군", "익산시", "임실군", "장수군", "전주시", "정읍시", "진안군");
        vnum = new Array("","1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14");
    }
    if (city == 38) {
        num = new Array("","강진군", "고흥군", "곡성군", "광양시", "구례군", "나주시", "담양군", "목포시", "무안군", "보성군", "순천시", "신안군", "여수시", "영광군", "영암군", "완도군", "장성군", "장흥군", "진도군", "함평군", "해남군", "화순군");
        vnum = new Array("","1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "16", "17", "18", "19", "20", "21", "22", "23", "24");
    }
    if (city == 39) {
        num = new Array("","남제주군", "북제주군", "서귀포시", "제주시");
        vnum = new Array("","1", "2", "3", "4");
    }

    for (i = 0; i < form.smallcity.length; i++) {
        form.smallcity.options[i] = null;
    }
    for (i = 0; i < num.length; i++) {
        console.log( form.smallcity.options[i] = new Option(num[i], vnum[i]));
        form.smallcity.options[i] = new Option(num[i], vnum[i]);
    }


}

function TravelChoice(travel_type) {
    if (travel_type == 12) {
        num = new Array("","자연", "인문(문화/예술/역사)");
        vnum = new Array("","A01", "A02");
    }

    if (travel_type == 14) {
        num = new Array("","인문(문화/예술/역사)");
        vnum = new Array("","AA02");
    }

    if (travel_type == 15) {
        num = new Array("","인문(문화/예술/역사)");
        vnum = new Array("","AAA02");
    }

    if (travel_type == 25) {
        num = new Array("","추천코스");
        vnum = new Array("","C01");
    }

    if (travel_type == 28) {
        num = new Array("","레포츠");
        vnum = new Array("","A03");
    }
    if (travel_type == 32) {
        num = new Array("","숙박");
        vnum = new Array("","B02");
    }
    if (travel_type == 38) {
        num = new Array("","쇼핑");
        vnum = new Array("","A04");
    }
    if (travel_type == 39) {
        num = new Array("","음식점");
        vnum = new Array("","A05");
    }


    for (i = 0; i < form.big_label.length; i++) {
        form.big_label.options[i] = null;
    }
    for (i = 0; i < num.length; i++) {
        form.big_label.options[i] = new Option(num[i], vnum[i]);
    }

    if(travel_type == 14 || travel_type == 15){
        return big_type(type_res, city_res);
    }


}

function big_type(big_num, type_res, city_res) {
    console.log(type_res);
    if (big_num == "A01") {

        num = new Array("","자연관광지", "관광자원");
        vnum = new Array("","A0101", "A0102");
    }

    if (big_num == "AA02") {
        num = new Array("","문화시설");
        vnum = new Array("","A0206");
    }
    if (big_num == "AAA02") {

        num = new Array("","축제", "공연/행사");
        vnum = new Array("","A0207", "A0208");
    }

    if (big_num == "A02") {

        num = new Array("","역사관광지", "휴양관광지", "체험관광지", "건축/조형물");
        vnum = new Array("","A0201", "A0202", "A0203", "A0205");

    }
    if (big_num == "C01") {

        num = new Array("","가족코스", "나홀로코스", "힐링코스", "도보코스", "캠핑코스", "맛코스");
        vnum = new Array("","C0112", "C0113", "C0114", "C0115", "C0116", "C0117");


    }

    if (big_num == "A03") {
        num = new Array("","육상 레포츠", "수상 레포츠", "항공 레포츠", "복합 레포츠");
        vnum = new Array("","A0302", "A0303", "A0304", "A0305");

    }

    if (big_num == "B02") {

        num = new Array("","숙박");
        vnum = new Array("","B0201");

    }

    if (big_num == "A04") {

        num = new Array("","쇼핑");
        vnum = new Array("","A0401");

    }

    if (big_num == "A05") {

        num = new Array("","음식");
        vnum = new Array("","A0502");

    }


    for (i = 0; i < form.middle_label.length; i++) {
        form.middle_label.options[i] = null;
    }
    for (i = 0; i < num.length; i++) {
        form.middle_label.options[i] = new Option(num[i], vnum[i]);
    }





}

function middle_type(mtype){
    if (mtype == "A0101") {
        num = new Array("국립공원","도립공원","군립공원","산","자연생태관광지","자연휴양림","수목원","폭포","계곡","약수터","해안절경","해수욕장","섬","항구/포구","어촌","등대","호수","강","동굴");
        vnum = new Array("A01010100","A01010200","A01010300","A01010400","A01010500","A01010600","A01010700","A01010800","A01010900","A01011000","A01011100","A01011200","A01011300","A01011400","A01011500","A01011600","A01011700","A01011800","A01011900");
    }

    if (mtype == "A0102") {
        num = new Array("희귀동-식물","기암괴석");
        vnum = new Array("A01020100","A01020200");
    }

    if (mtype == "A0201") {
        num = new Array("고궁","성","문","고택","생가","민속마을","유적지/사적지","사찰","종교성지","안보관광");
        vnum = new Array("A02010100","A02010200","A02010300","A02010400","A02010500","A02010600","A02010700","A02010800","A02010900","A02011000");
    }
    if (mtype == "A0202") {
        num = new Array("유원지","관광단지","온천/욕장/스파","이색찜질방","헬스투어","테마공원","공원","유람선/잠수함관광");
        vnum = new Array("A02020100","A02020200","A02020300","A02020400","A02020500","A02020600","A02020700","A02020800",);
    }
    if (mtype == "A0203") {
        num = new Array("농.산.어촌 체험","전통체험","산사체험","이색체험","관광농원","이색거리");
        vnum = new Array("A02030100","A02030200","A02030300","A02030400","A02030500","A02030600");
    }

    if(mtype =="A0205"){
        num = new Array("다리/대교","기념탑/기념비/전망대","분수","동상","터널","유명건물");
        vnum = new Array("A02050100","A02050200","A02050300","A02050400","A02050500","A02050600");
    }
    if(mtype =="A0206"){
        num = new Array("박물관","기념관","전시관","컨벤션센터","미술관/화랑","공연장","문화원","외국문화원","도서관","대형서점","문화전수시설","영화관","어학당","학교");
        vnum = new Array("A02060100","A02060200","A02060300","A02060400","A02060500","A02060600","A02060700","A02060800","A02060900","A02061000","A02061100","A02061200","A02061300","A02061400");
    }
    if (mtype == "A0207") {
        num = new Array("문화관광축제","일반축제");
        vnum = new Array("A02070100","A02070200");
    }
    if (mtype == "A0208") {
        num = new Array("전통공연","연극","뮤지컬","오페라","전시회","박람회","컨벤션","무용","클래식음악회","대중콘서트","영화","스포츠경기","기타행사");
        vnum = new Array("A02080100","A02080200","A02080300","A02080400","A02080500","A02080600","A02080700","A02080800","A02080900","A02081000","A02081100","A02081200","A02081300");
    }
    if (mtype == "A0207") {
        num = new Array("문화관광축제","일반축제");
        vnum = new Array("A02070100","A02070200");
    }
    if (mtype == "C0112") {
        num = new Array("가족코스");
        vnum = new Array("C01120001");
    }
    if (mtype == "C0113") {
        num = new Array("나홀로코스");
        vnum = new Array("C01130001");
    }
    if (mtype == "C0114") {
        num = new Array("힐링코스");
        vnum = new Array("C01140001");
    }
    if (mtype == "C0115") {
        num = new Array("도보코스");
        vnum = new Array("C01150001");
    }
    if (mtype == "C0116") {
        num = new Array("캠핑코스");
        vnum = new Array("C01160001");
    }
    if (mtype == "C0117") {
        num = new Array("맛코스");
        vnum = new Array("C01170001");
    }
    if (mtype == "A0302") {
        num = new Array("스포츠센터","수련시설","경기장","인라인(실내 인라인 포함)","자전거하이킹","카트","골프","경마","경륜","카지노","승마","스키/스노보드","스케이트","썰매장","수렵장","사격장","야영장","오토캠핑장","암벽등반","빙벽등반","서바이벌게임","ATV","MTB","오프로드","번지점프","자동차경주","스키(보드) 렌탈샵","트래킹");
        vnum = new Array("A03020100","A03020200","A03020300","A03020400","A03020500","A03020600","A03020700","A03020800","A03020900","A03021000","A03021100","A03021200","A03021300","A03021400","A03021500","A03021600","A03021700","A03021800","A03021900","A03022000","A03022100","A03022200","A03022300","A03022400","A03022500","A03022600","A03022700");
    }
    if (mtype == "A0303") {
        num = new Array("윈드서핑/제트스키","카약/카누","요트","스노쿨링/스킨스쿠버다이빙","민물낚시","바다낚시","수영","래프팅");
        vnum = new Array("A03030100","A03030200","A03030300","A03030400","A03030500","A03030600","A03030700","A03030800");
    }
    if (mtype == "A0304") {
        num = new Array("스카이다이빙","초경량비행","헹글라이딩/패러글라이딩","열기구");
        vnum = new Array("A03040100","A03040200","A03040300","A03040400");
    }
    if (mtype == "A0305") {
        num = new Array("복합 레포츠");
        vnum = new Array("A03050100");
    }
    if (mtype == "B0201") {
        num = new Array("관광호텔","수상관광호텔","전통호텔","가족호텔","콘도미니엄","유스호스텔","펜션","여관","모텔","민박","게스트하우스","홈스테이","서비스드레지던스","의료관광호텔","소형호텔","한옥스테이");
        vnum = new Array("B02010100","B02010200","B02010300","B02010400","B02010500","B02010600","B02010700","B02010800","B02010900","B02011000","B02011100","B02011200","B02011300","B02011400","B02011500","B02011600");
    }
    if (mtype == "A0401") {
        num = new Array("5일장","상설시장","백화점","면세점","할인매장","전문상가","공예,공방","관광기념품점","특산물판매점");
        vnum = new Array("A04010100","A04010200","A04010300","A04010400","A04010500","A04010600","A04010700","A04010800","A04010900");
    }
    if (mtype == "A0502") {
        num = new Array("한식","서양식","일식","중식","아시아식","패밀리레스토랑","이색음식점","채식전문점","바/까페","클럽");
        vnum = new Array("A05020100","A05020200","A05020300","A05020400","A05020500","A05020600","A05020700","A05020800","A05020900","A05021000");
    }
    for (i = 0; i < form.small_label.length; i++) {
        form.small_label.options[i] = null;
    }
    for (i = 0; i < num.length; i++) {
        form.small_label.options[i] = new Option(num[i], vnum[i]);
    }
}